#+TITLE: Project development
#+AUTHOR: Maksymilian Jodłowski

* What is this?

This document will have all the plans and documentation for the project.

Using Emacs with Org mode strongly advised.

* Running the project
** Requirements

- [[https://www.php.net/releases/8.1/en.php][PHP 8.1]]
- [[https://lumen.laravel.com/docs/8.x#installation][Laravel Lumen]]
- [[https://lumen.laravel.com/docs/5.7/database#configuration][Supported database]]

** Optional

- [[https://phpunit.de/][PHPUnit]]

** Create a .env file

Copy the example /.env/ file

#+begin_src shell
cp .env.example .env
#+end_src

It should look like this:

#+begin_src conf
APP_NAME=Chan
APP_ENV=local
APP_KEY=
APP_DEBUG=true
APP_URL=http://localhost
APP_TIMEZONE=UTC

LOG_CHANNEL=stack
LOG_SLACK_WEBHOOK_URL=

DB_CONNECTION=mysql
DB_HOST=127.0.0.1
DB_PORT=3306
DB_DATABASE=chan
DB_USERNAME=homestead
DB_PASSWORD=secret

CACHE_DRIVER=file
QUEUE_CONNECTION=sync
#+end_src

Setup your database connection by setting the /DB_/ fields appropriately.

Example with postgresql:

#+begin_src conf
APP_NAME=Chan
APP_ENV=local
APP_KEY=
APP_DEBUG=true
APP_URL=http://localhost
APP_TIMEZONE=UTC

LOG_CHANNEL=stack
LOG_SLACK_WEBHOOK_URL=

DB_CONNECTION=pgsql
DB_HOST=127.0.0.1
DB_PORT=5432
DB_DATABASE=chan
DB_USERNAME=your_user
DB_PASSWORD=your_password

CACHE_DRIVER=file
QUEUE_CONNECTION=sync
#+end_src

** Run tests

Run `phpunit` in the project root directory

#+begin_src shell :results output
phpunit
#+end_src

#+RESULTS:
: PHPUnit 9.5.10 by Sebastian Bergmann and contributors.
:
: ....                                                                4 / 4 (100%)
:
: Time: 00:00.155, Memory: 40.28 MB
:
: OK (4 tests, 8 assertions)

** Run migrations

#+begin_src shell
php artisan migrate:fresh
#+end_src

*Optional* run seeders

#+begin_src shell
php artisan db:seed
#+end_src

** Run the server

#+begin_src shell
php -S localhost:8000 -t public
#+end_src

* Project minimum

Here we will go over the minimum working functionality expected in the *next* master branch merge.
You can read *next* as *current* if you're reading this in the master branch.
Read this document on develop branch for upcoming changes.

Basically everything will be described here.

** Errors

Error responses follow Google's style.

Some Google API documentation that will help understand how they are portrayed:

[[https://cloud.google.com/storage/docs/json_api/v1/status-codes]]

[[https://developers.google.com/calendar/api/guides/errors]]


*** Not Found

Example json response:

#+begin_src json
{
  "error": {
    "errors": [
      {
        "domain": "global",
        "reason": "notFound",
        "message": "Not Found"
      }
    ],
    "code": 404,
    "message": "Not Found"
  }
}
#+end_src

#+begin_src http
GET localhost:8000/boards/653e9a6d-1830-4165-8ca7-6f551e4e0ae1
Accept: application/json
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 404 Not Found
Host: localhost:8000
Date: Fri, 07 Jan 2022 16:20:35 GMT
Connection: close
X-Powered-By: PHP/8.1.1
Cache-Control: no-cache, private
Date: Fri, 07 Jan 2022 16:20:35 GMT
Content-Type: application/json

{"error":{"errors":[{"domain":"global","reason":"notFound","message":"Not Found"}],"code":404,"message":"Not Found"}}
#+end_example

*** Invalid Uuid

Location has a special format when locationType is `path`:

- `{}` is the exact location of the problematic variable
- `{name}` where name is the variable name is for other variables

Example json response:

#+begin_src json
{
  "error": {
    "errors": [
      {
        "domain": "thread",
        "reason": "invalidUuid",
        "message": "`123` is not a valid UUIDv4.",
        "locationType": "path",
        "location": "/boards/{board_uuid}/threads/{}"
      }
    ],
    "code": 400,
    "message": "`123` is not a valid UUIDv4."
  }
}
#+end_src

Example way to trigger:

#+begin_src http
GET localhost:8000/boards/653e9a6d-1830-4165-8ca7-6f551e4e0ae1/threads/123
Accept: application/json
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 400 Bad Request
Host: localhost:8000
Date: Fri, 07 Jan 2022 16:22:29 GMT
Connection: close
X-Powered-By: PHP/8.1.1
Cache-Control: no-cache, private
Date: Fri, 07 Jan 2022 16:22:29 GMT
Content-Type: application/json

{"error":{"errors":[{"domain":"thread","reason":"invalidUuid","message":"`123` is not a valid UUIDv4.","locationType":"path","location":"\/boards\/{board_uuid}\/threads\/{}"}],"code":400,"message":"`123` is not a valid UUIDv4."}}
#+end_example

** Boards
*** Base model

    | attribute   | type   | example                              | extra   |
    |-------------+--------+--------------------------------------+---------|
    | id          | uuidv4 | 0bb3abb9-986c-47a3-9a1c-c61e67d506f2 |         |
    | name        | text   | Technology                           | unique  |
    | shorthand   | text   | g                                    | unique  |
    | description | text   | /g/ - Technology                     | virtual |

In json format:

#+begin_src json
{
    "id": "0bb3abb9-986c-47a3-9a1c-c61e67d506f2",
    "name": "Technology",
    "shorthand": "g",
    "description": "/g/ - Technology"
}
#+end_src

*** Endpoints
**** List all boards

Request format:

#+begin_src http
GET localhost:8000/boards/
Accept: application/json
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Host: localhost:8000
Date: Fri, 07 Jan 2022 00:24:21 GMT
Connection: close
X-Powered-By: PHP/8.1.1
Cache-Control: no-cache, private
Date: Fri, 07 Jan 2022 00:24:21 GMT
Content-Type: application/json

[{"id":"0bb3abb9-986c-47a3-9a1c-c61e67d506f2","name":"Technology","shorthand":"g","description":"\/g\/ - Technology"},{"id":"db86fdc5-edfd-43ae-bc59-199262fa6f8c","name":"Science","shorthand":"sci","description":"\/sci\/ - Science"}]
#+end_example

Example response json:

#+begin_src json
[
  {
    "id": "0bb3abb9-986c-47a3-9a1c-c61e67d506f2",
    "name": "Technology",
    "shorthand": "g",
    "description": "/g/ - Technology"
  },
  {
    "id": "db86fdc5-edfd-43ae-bc59-199262fa6f8c",
    "name": "Science",
    "shorthand": "sci",
    "description": "/sci/ - Science"
  }
]
#+end_src

**** Show single board

Request format:

#+begin_src http
GET localhost:8000/boards/0bb3abb9-986c-47a3-9a1c-c61e67d506f2
Accept: application/json
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Host: localhost:8000
Date: Fri, 07 Jan 2022 00:53:52 GMT
Connection: close
X-Powered-By: PHP/8.1.1
Cache-Control: no-cache, private
Date: Fri, 07 Jan 2022 00:53:52 GMT
Content-Type: application/json

{"id":"0bb3abb9-986c-47a3-9a1c-c61e67d506f2","name":"Technology","shorthand":"g","description":"\/g\/ - Technology"}
#+end_example

Example response json:

#+begin_src json
{
  "id": "0bb3abb9-986c-47a3-9a1c-c61e67d506f2",
  "name": "Technology",
  "shorthand": "g",
  "description": "/g/ - Technology"
}
#+end_src

** Threads
*** Base model

    | attribute  | type     | example                              | extra                                       |
    |------------+----------+--------------------------------------+---------------------------------------------|
    | id         | uuidv4   | 1592fe29-bddb-4279-b47d-bb41e23a67a0 |                                             |
    | board_id   | uuidv4   | eb6f2aa2-b9a7-4239-a89c-8d2cef484dae |                                             |
    | op_id      | uuidv4   | c96ffb89-028a-4546-8f47-24b40ca00671 | unused(NULL allowed) until replies are done |
    | created_at | datetime | 2022-01-06T21:01:24.000000Z          |                                             |
    | updated_at | datetime | 2022-01-06T21:01:24.000000Z          | update at each message posted               |

   In json format:

   #+begin_src json
   {
      "id": "f13c22ad-02db-474c-b70a-d400cab11760",
      "board_id": "db86fdc5-edfd-43ae-bc59-199262fa6f8c",
      "op_id": null,
      "created_at": "2022-01-01T00:05:30.000000Z",
      "updated_at": "2022-01-01T00:05:00.000000Z"
   }
   #+end_src

*** Endpoints
**** List threads per board

Request format:

#+begin_src http
GET localhost:8000/boards/eb6f2aa2-b9a7-4239-a89c-8d2cef484dae/threads
Accept: application/json
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Host: localhost:8000
Date: Fri, 07 Jan 2022 00:52:13 GMT
Connection: close
X-Powered-By: PHP/8.1.1
Cache-Control: no-cache, private
Date: Fri, 07 Jan 2022 00:52:13 GMT
Content-Type: application/json

[{"id":"f13c22ad-02db-474c-b70a-d400cab11760","board_id":"db86fdc5-edfd-43ae-bc59-199262fa6f8c","op_id":null,"created_at":"2022-01-01T00:05:30.000000Z","updated_at":"2022-01-01T00:05:00.000000Z"},{"id":"005c8a09-482d-4622-9b06-db991982f450","board_id":"db86fdc5-edfd-43ae-bc59-199262fa6f8c","op_id":null,"created_at":"2022-01-01T00:04:30.000000Z","updated_at":"2022-01-01T00:04:00.000000Z"},{"id":"4a78d954-f872-48c9-8a7f-0d56677512e6","board_id":"db86fdc5-edfd-43ae-bc59-199262fa6f8c","op_id":null,"created_at":"2022-01-01T00:03:30.000000Z","updated_at":"2022-01-01T00:03:00.000000Z"}]
#+end_example

Example response json:
#+begin_src json
[
  {
    "id": "f13c22ad-02db-474c-b70a-d400cab11760",
    "board_id": "db86fdc5-edfd-43ae-bc59-199262fa6f8c",
    "op_id": null,
    "created_at": "2022-01-01T00:05:30.000000Z",
    "updated_at": "2022-01-01T00:05:00.000000Z"
  },
  {
    "id": "005c8a09-482d-4622-9b06-db991982f450",
    "board_id": "db86fdc5-edfd-43ae-bc59-199262fa6f8c",
    "op_id": null,
    "created_at": "2022-01-01T00:04:30.000000Z",
    "updated_at": "2022-01-01T00:04:00.000000Z"
  },
  {
    "id": "4a78d954-f872-48c9-8a7f-0d56677512e6",
    "board_id": "db86fdc5-edfd-43ae-bc59-199262fa6f8c",
    "op_id": null,
    "created_at": "2022-01-01T00:03:30.000000Z",
    "updated_at": "2022-01-01T00:03:00.000000Z"
  }
]
#+end_src

**** TODO Create thread
** TODO Replies
